mahdi-benhassen/esp-agrinet-zigbee-glm5.2/nodes/sensor_node/sdkconfig.defaults
# Sensor node sdkconfig defaults
# Target: ESP32-H2

CONFIG_IDF_TARGET="esp32h2"

# Zigbee end-device
CONFIG_ZB_ENABLED=y
CONFIG_ZB_SDK_1xx=y
CONFIG_ZB_ZED=y
CONFIG_ZB_RADIO_NATIVE=y

# Console on USB-Serial-JTAG (ESP32-H2 has no native USB but DevKitM exposes UART0 via USB bridge)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_LOG_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# I2C
CONFIG_I2C_MASTER_ENABLED=y
CONFIG_I2C_MASTER_FIFO_LEN=128

# ADC
CONFIG_ADC_ONESHOT=y
CONFIG_ADC_CONTINUOUS=y
CONFIG_ADC_CAL_EFUSE_TP_ENABLE=y
CONFIG_ADC_CAL_EFUSE_VREF_ENABLE=y

# Power management - light sleep allowed for battery operation
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y

# Partition
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# Flash size (ESP32-H2 DevKitM-1 has 4MB)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# NVS
CONFIG_NVS_ENCRYPTION=n

# FreeRTOS
CONFIG_FREERTOS_HZ=100

# Watchdog
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=60
